"""
编写一个程序，通过已填充的空格来解决数独问题。

数独的规则如下：
数字 1-9在每一行只能出现一次
数字 1-9在每一列只能出现一次
数字 1-9在每一个以粗实线分隔的 3×3宫内只能出现一次
空格用 '.'表示
说明：
给定的数独序列只包含数字 1-9和字符 '.'
你可以假设给定的数独只有唯一解
给定数独永远是 9×9形式的

输入:
[
  ["5","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]

输出:
[
  ["5","3","4","6","7","8","9","1","2"],
  ["6","7","2","1","9","5","3","4","8"],
  ["1","9","8","3","4","2","5","6","7"],
  ["8","5","9","7","6","1","4","2","3"],
  ["4","2","6","8","5","3","7","9","1"],
  ["7","1","3","9","2","4","8","5","6"],
  ["9","6","1","5","3","7","2","8","4"],
  ["2","8","7","4","1","9","6","3","5"],
  ["3","4","5","2","8","6","9","7","9"]
]
"""


def solve(board):
    def is_valid(row, col, target_num):
        """检查row, col位置填入目标target num是否合法"""

        # 检查行
        for j in range(9):
            if board[row][j] == target_num:
                return False

        # 检查列
        for i in range(9):
            if board[i][col] == target_num:
                return False

        # 检查3*3
        start_row = (row // 3) * 3
        start_col = (col // 3) * 3
        for i in range(start_row, start_row + 3):
            for j in range(start_col, start_col + 3):
                if board[i][j] == target_num:
                    return False

        return True

    def backtrack():
        for i in range(9):
            for j in range(9):
                if board[i][j] == ".":
                    for num in range(1, 10):
                        if is_valid(i, j, num):
                            # 做选择
                            board[i][j] = num

                            # 递归
                            if backtrack():
                                return True

                            # 回溯
                            board[i][j] = "."

                    # 1~9 都试过了，还不行
                    return False
        return True

    backtrack()
    return board


if __name__ == '__main__':
    pass
