"""
给你一个整数数组 nums，请你找出一个具有最大和的连续子数组（子数组最少包含一个元素），返回其最大和。

输入：nums = [-2,1,-3,4,-1,2,1,-5,4]
输出：6
解释：连续子数组 [4,-1,2,1] 的和最大，为 6。

输入：nums = [-2,1,-3,4,-1,2,1,-5,4]
输出：6
解释：连续子数组 [4,-1,2,1] 的和最大，为 6。
"""

"""
dp[i]:
以nums[i]为结尾的连续子数组的最大和

两种选择：
1. 前一个数小于0，只能单独开始新的子数组：nums[i]
2. 前一个数大于等于0，继续子数组：dp[i-1] + nums[i]
dp[i] = max(nums[i], dp[i-1] + nums[i]))
"""


def solve(nums):
    n = len(nums)
    dp = [0] * n
    dp[0] = nums[0]

    for i in range(1, n):
        dp[i] = max(dp[i-1] + nums[i], nums[i])

    return max(dp)
