"""给定一个十进制整数，输出它在二进制下的翻转结果。

输入: n = 00000010100101000001111010011100
输出: 964176192 (00111001011110000010100101000000)
解释: 输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
"""

def reverseBits(n: int) -> int:
    result = 0

    for i in range(32):
        # 获取n的最低位
        bit = n & 1

        # 结果左移
        result <<= 1

        # 将n的最低位加到结果上
        result |= bit

        # n右移一位
        n >>= 1
    return result


if __name__ == '__main__':
    print(reverseBits(43261596))  # 964176192
